package lesson1503;
/*
Даны длина, ширина прямоугольника. Найти и вывести в консоль его площадь.
 */
public class Lesson1503 {
    public static void main(String[] args) {
        double length = 20.5;
        double width = 10.2;
        double area = length*width;
        System.out.println("Площадь прямоугольника со сторонами "+length+" и "+width+ " равна "+area);


    }
}
